DaniMzT/MyProjects_STM32NucleoF091/Train/Src/train_LCD_timers.c
	/*GPIOs for the I2C handled by i2cGPIOs-->PB6,9 i2c1 is the handle for I2C1*/
	memset(&i2cGPIOs,0,sizeof(i2cGPIOs));
	memset(&i2c1,0,sizeof(i2c1));

	//initialize timer structures to avoid garbage values
	memset(&timer7,0,sizeof(timer7));

	//Configurations and initilizations
	peripheral_Config_Ini();

	/*configure interrupts (without priorities atm)*/
	//Button OnOff (GPIOB0)
	GPIO_IRQ_EnableDisable(IRQ_EXTI2_3, ENABLE);
	//Button Emergency (GPIOB2)
	GPIO_IRQ_EnableDisable(IRQ_EXTI4_15, ENABLE);
	//SPI1
	SPI_IRQ_EnableDisable(IRQ_SPI1, ENABLE);
	//I2C1
	I2C_IRQ_EnableDisable(IRQ_I2C1, ENABLE);
	//Timer 7
	BasicTimer_IRQ_EnableDisable(TIM7, ENABLE);

	//Start timer counter
	BasicTimer_RestartCounter(&timer7);

	/* Loop forever */
	while (1){
		//Send information to display in LCD via SPI through Arduino when there is a state change or new station (virtual basic timer update)
		if (VirtualBasicTimer_Elapsed(&train_virtualTimer) == VIRTUAL_BASIC_TIMER_ELAPSED){ //if emergency/off,virtual timer !=ACTIVE--> FUNCTION_NOT_ACCESSIBLE
			switch(trainDirection){
				case RIGHT:
					trainStation++;
					if (trainStation >= TRAIN_STATIONS) {
						trainDirection = LEFT;
					}
					break;
				case LEFT:
					trainStation--;
					if (trainStation <= 0) {
						trainDirection = RIGHT;
					}
					break;
				default:
					//error
					break;
			}
			//spi_appComm(&message_spi);
			VirtualBasicTimer_StartCounter(&train_virtualTimer); //improve protection in case emergency/off states happened during function?
		}
		if (stateChanged){
			//spi_appComm(&message_spi);
		}

		//Read temperature sensor via I2C at every timer counter update (restart_I2C==1)
		if (restart_I2C || (flagADS1115 != ADS1115_NOT_STARTED)){
			restart_I2C = 0;
			configureADS1115(&i2c1);
			if ((flagADS1115 == ADS1115_CONFIGURED) && !startRX) {
				//I2C_EnableDisable(&i2c1,ENABLE);
				I2C_Master_Receiver(&i2c1, ADS1115_CONVERSION_REGISTER_BYTES, 1, bytes_from_ADS1115);//1st byte read(MSB of Conversion register)+2nd byte read(LSB)
				startRX = 1;
				//I2C_Start(&i2c1); //triggered directly in I2C_Master_Receiver;in case of problems,do it from here and comment in I2C_Master_Receiver
			}
		}

	}
}
/**********************************************END MAIN********************************************************************/

/***********************************************ISR handlers****************************************************************/
void EXTI2_3_IRQHandler(void){ //when button on-off
	delay(500000);
	GPIO_IRQ_Handling(PIN_BUTTON_OFFON);
	if (currentState == OFF){
		currentState = ON;
		stateChanged = 1;
		//start or resume the virtual timer as if the train started/resumed movement
		VirtualBasicTimer_EnableDisable(&train_virtualTimer,ENABLE);
		VirtualBasicTimer_StartCounter(&train_virtualTimer);
		GPIO_WritePin(GPIOA,PIN_LED0,0);
		GPIO_WritePin(GPIOA,PIN_LED1,1);
		GPIO_WritePin(GPIOA,PIN_LED2,1);
		GPIO_WritePin(GPIOA,PIN_LED3,0);
	}
	else{
		currentState = OFF;
		stateChanged = 1;
		//stop the virtual timer as if the train had stopped
		VirtualBasicTimer_StopCounter(&train_virtualTimer);
		VirtualBasicTimer_EnableDisable(&train_virtualTimer,DISABLE);
		GPIO_WritePin(GPIOA,PIN_LED0,0);
		GPIO_WritePin(GPIOA,PIN_LED1,0);
		GPIO_WritePin(GPIOA,PIN_LED2,0);
		GPIO_WritePin(GPIOA,PIN_LED3,0);
	}
	//printf("%d\n",currentState);
}

void EXTI4_15_IRQHandler(void){
	delay(500000);
	GPIO_IRQ_Handling(PIN_BUTTON_EMERGENCY);
	if (currentState != EMERGENCY){
		stateChanged = 1;
	}
	currentState = EMERGENCY;
	//stop the virtual timer as if the train had stopped
	VirtualBasicTimer_StopCounter(&train_virtualTimer);
	VirtualBasicTimer_EnableDisable(&train_virtualTimer,DISABLE);
	//printf("%d\n",currentState);
	GPIO_WritePin(GPIOA,PIN_LED0,1);
	GPIO_WritePin(GPIOA,PIN_LED1,1);
	GPIO_WritePin(GPIOA,PIN_LED2,1);
	GPIO_WritePin(GPIOA,PIN_LED3,1);

}

//SPI IRQ handler for SPI1. declared in startup_stm32f091rctx.s
void SPI1_IRQHandler(void){
	SPI_IRQ_Handling(&spi1);
}


/*callback,declared in spi.h,called from tx/rx handlers when finished
 * I use it just for debugging to avoid reading registers from debugger (if read,SR modified)
 */
/*void SPI_App_Callback(SPI_Handle_t *pSPIhandle,uint8_t Event){
	//NOT NECESSARY SO FAR BECAUSE I'M USING if WITH RX/TX STATE == READY (it's volatile)
}*/

//I2C
//I2C1 IRQ handler, from startup_stm32f091rctx.s
void I2C1_IRQHandler(void){
	I2C_IRQ_Handling(&i2c1);
}
//callback
void I2C_App_Callback(I2C_Handle_t *pI2Chandle,uint8_t Event){
	if (Event == I2C_FINISHED){
		//if ADS1115 not configured yet,focus on that:
		if (flagADS1115 != ADS1115_CONFIGURED){
			switch (flagADS1115){
			case ADS1115_1ST_DURING:
				flagADS1115 = ADS1115_1ST_DONE;
				break;
			case ADS1115_2ND_DURING:
				flagADS1115 = ADS1115_CONFIGURED;
				break;

			default:
				break;
			}
		}
		else{ //if ADS1115 has already been configured and a STOPF happens, disable I2C
			I2C_EnableDisable(&i2c1,DISABLE);
		}

	}
	else if (Event == I2C_NEW_READING){ //here when RX length == 0
		lastADS1115_raw = (bytes_from_ADS1115[0] << 8)|(bytes_from_ADS1115[1]); //byteRead is LSB and firstByteRead is MSB
		lastADS1115_mV = lastADS1115_raw * ADS1115_GAIN/ADS1115_MAX;
		flagADS1115 = ADS1115_NOT_STARTED;
		//restart_I2C = 1; //now called from BasicTimer_App_Callback
		startRX = 0;
		//testCounter_measurements++; //TESTING
	}

}

//TIMERS
void TIM7_IRQHandler (void){
	BasicTimer_IRQ_Handling(&timer7);
}

void BasicTimer_App_Callback(BasicTimer_Handle_t *pBasicTimerhandle){
    //disable the interrupt during callback just in case?
    //BasicTimer_EnableDisable(&timer7, DISABLE);

    //Overflow counter, let everything based on the timer know it
	restart_I2C = 1; //start I2C reading in the main loop

    //enable the interrupt again if disabled previously
    //BasicTimer_EnableDisable(&timer7, ENABLE);
}

/**********************************************END IRQ********************************************************************/

/*****************************Configurations and initializations************************************************************/
void peripheral_Config_Ini(void){

	//local variables
	uint8_t param1, param2, param3, param4, param5;
	/**********************LEDS***********************************************/
	//LED0. PA0
	leds.pGPIO = GPIOA;
	leds.GPIO_PinConfig.GPIO_PinNumber = PIN_LED0;
	leds.GPIO_PinConfig.GPIO_PinMode = GPIO_OUT;
	leds.GPIO_PinConfig.GPIO_PinOutType = GPIO_PUSHPULL;
	leds.GPIO_PinConfig.GPIO_PinOutSpeed = GPIO_SLOWSPEED; //GPIO_MEDIUMSPEED
	leds.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_NOPULL;
	//Initialization LED0
	GPIO_PinInit(&leds);

	//LED1.PA1.Port,Mode,OutType,OutSpeed and PullUpDown same as LED0
	leds.GPIO_PinConfig.GPIO_PinNumber = PIN_LED1;
	//Initialization LED1
	GPIO_PinInit(&leds);

	//LED2.PA9.Port,Mode,OutType,OutSpeed and PullUpDown same as LED0
	leds.GPIO_PinConfig.GPIO_PinNumber = PIN_LED2;
	//Initialization LED2
	GPIO_PinInit(&leds);

	//LED3.PA10.Port,Mode,OutType,OutSpeed and PullUpDown same as LED0
	leds.GPIO_PinConfig.GPIO_PinNumber = PIN_LED3;
	//Initialization LED3
	GPIO_PinInit(&leds);

	//LEDs OFF
	GPIO_WritePin(GPIOA,PIN_LED0,1);
	GPIO_WritePin(GPIOA,PIN_LED1,0);
	GPIO_WritePin(GPIOA,PIN_LED2,0);
	GPIO_WritePin(GPIOA,PIN_LED3,1);

	/***************************************BUTTONS********************************/
	//BUTTON ON-OFF. PB3
	buttons.pGPIO = GPIOB;
	buttons.GPIO_PinConfig.GPIO_PinNumber = PIN_BUTTON_OFFON;
	buttons.GPIO_PinConfig.GPIO_PinMode = GPIO_FALL_TRIG; //interrupt falling edge
	buttons.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_PULLUP; //pull up (3.3 by default)
	//initialization button on-off
	GPIO_PinInit(&buttons);

	//EMERGENCY BUTTON. PB5
	buttons.pGPIO = GPIOB;
	buttons.GPIO_PinConfig.GPIO_PinNumber = PIN_BUTTON_EMERGENCY;
	buttons.GPIO_PinConfig.GPIO_PinMode = GPIO_FALL_TRIG;
	buttons.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_PULLUP;
	//initialization emergency button
	GPIO_PinInit(&buttons);

	/**************************************SPI***********************************/
	//GPIOs for SPI: SPI1 PA4:NSS PA5:SCK PA6:MISO PA7:MOSI. Alternate function AF0
	spiGPIOs.pGPIO = GPIOA;
	spiGPIOs.GPIO_PinConfig.GPIO_PinMode = GPIO_ALTFUN;
	spiGPIOs.GPIO_PinConfig.GPIO_PinAlterFunc = GPIO_AF0;
	spiGPIOs.GPIO_PinConfig.GPIO_PinOutType = GPIO_PUSHPULL;
	spiGPIOs.GPIO_PinConfig.GPIO_PinOutSpeed = GPIO_HIGHSPEED; //FAST SPEED
	spiGPIOs.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_NOPULL;
	//SCK
	spiGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_SPI1_SCK;//SCK
	GPIO_PinInit(&spiGPIOs);

	spiGPIOs.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_PULLUP;
	//NSS
	spiGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_SPI1_NSS;//NSS
	GPIO_PinInit(&spiGPIOs);
	//MISO
	spiGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_SPI1_MISO;//MISO
	GPIO_PinInit(&spiGPIOs);
	//MOSI
	spiGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_SPI1_MOSI;//MOSI
	GPIO_PinInit(&spiGPIOs);

	/*SPI handle configuration and initialization*/
	//SPI configuration
	spi1.pSPI = SPI1_I2S1;
	spi1.SPI_Config.SPI_Mode = SPI_MASTER;
	spi1.SPI_Config.SPI_Speed = SPI_SPEED_2;
	spi1.SPI_Config.SPI_CommType = SPI_FULLDUPLEX;
	spi1.SPI_Config.SPI_DataSize = SPI_8BIT;
	spi1.SPI_Config.SPI_SWslave = SPI_HW_MGMT;
	spi1.SPI_Config.SPI_Pol = SPI_CLK_IDLE_0;
	spi1.SPI_Config.SPI_Phase = SPI_CLK_CAPT_FIRST;

	//SPI initialization
	SPI_Init(&spi1);

	//Set SSOE to 1 to make NSS output enable
	SPI_SSOE(&spi1,ENABLE);

