DaniMzT/MyProjects_STM32NucleoF091/Train/Src/train_LCD_timers.c
	//Enable SPI peripheral
	SPI_EnableDisable(&spi1,ENABLE);

	/**********************************I2C*****************************************/
	//GPIOs for I2C: PB6(SCL), PB9(SDA).Alternate function AF1!
	i2cGPIOs.pGPIO = GPIOB;
	i2cGPIOs.GPIO_PinConfig.GPIO_PinMode = GPIO_ALTFUN;
	i2cGPIOs.GPIO_PinConfig.GPIO_PinAlterFunc = GPIO_AF1;
	i2cGPIOs.GPIO_PinConfig.GPIO_PinOutType = GPIO_PUSHPULL;
	i2cGPIOs.GPIO_PinConfig.GPIO_PinOutSpeed = GPIO_HIGHSPEED; //FAST SPEED
	i2cGPIOs.GPIO_PinConfig.GPIO_PinPullUpDown = GPIO_PULLUP; //internal pull up
	//SCL
	i2cGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_I2C1_SCL;//SCL
	GPIO_PinInit(&i2cGPIOs);
	//SDA
	i2cGPIOs.GPIO_PinConfig.GPIO_PinNumber = PIN_I2C1_SDA;//SDA
	GPIO_PinInit(&i2cGPIOs);

	/*I2C configuration*/
	i2c1.pI2C = I2C1;
	//timing according to table for 100kHz I2C,8MHz clock
	param1 = 0x01;//PRESC
	param2 = 0x04;//SCLDEL
	param3 = 0x02;//SDADEL
	param4 = 0x0F;//SCLH
	param5 = 0x13;//SCLL
	I2C_Master_TimingR(&i2c1, param1, param2, param3, param4, param5);
	i2c1.I2C_Config.I2C_AddressMode = I2C_ADDRESS_MODE_7BIT;
	i2c1.I2C_Comm_t.I2C_SlaveAddress = ADS1115_ADDRESS; //ADS1115 address
	i2c1.I2C_Comm_t.I2C_Nbytes = 1;
	i2c1.I2C_Comm_t.RX_length = 1;
	i2c1.I2C_Comm_t.I2C_RepeatStart = I2C_AUTOEND;

	//I2C initialization
	I2C_Init(&i2c1);
	//Enable I2C peripheral
	I2C_EnableDisable(&i2c1,ENABLE);

	/********************************TIMERS******************************************/
	//Timer 7 configuration
	timer7.pBasicTimer = BASIC_TIMER_7;
	timer7.BasicTimer_Config.BasicTimer_arpe = DISABLE; //0: autoreload ARR updated if changed
	timer7.BasicTimer_Config.BasicTimer_opm = DISABLE; //0: counter not stopped at update event
	timer7.BasicTimer_Config.BasicTimer_urs = ENABLE; //1: only overflow for interrupts
	timer7.BasicTimer_Config.BasicTimer_udis = DISABLE;
	//freq:8MHz.I2C meas/20s(real app:1min).Train stations/5s(simulation;reality with motor.timer tick:150Hz(min:8MHz/FFFF=133).arr:20s
	timer7.BasicTimer_Config.BasicTimer_prescaler = 53332; //prescaler=(clock_freq/timerTick_freq)-1=53332 (0xD054)
	timer7.BasicTimer_Config.BasicTimer_autoreload = 3000; //max value. 20s/(1/150)=3000 (0xBB8)

	//Timer 7 initialization
	BasicTimer_Init(&timer7);
	//Enable timer 7
	BasicTimer_EnableDisable(&timer7, ENABLE);

	//Virtual timer configuration, here used for
	train_virtualTimer.realTimer = timer7;
	train_virtualTimer.configured_counter_value = (train_virtualTimer.realTimer.BasicTimer_Config.BasicTimer_autoreload/4);
	train_virtualTimer.counter_value_preStop = 0;
	if (currentState == ON){
		VirtualBasicTimer_EnableDisable(&train_virtualTimer, ENABLE); //it does not start the virtual timer yet
		VirtualBasicTimer_StartCounter(&train_virtualTimer); //virtual timer starts
	}

}
/*********************************CONFIGURE ADS1115**********************************************/
void configureADS1115(I2C_Handle_t *pI2Chandle){
	//https://cdn-shop.adafruit.com/datasheets/ads1115.pdf
	if (flagADS1115 < ADS1115_1ST_DURING){
		//continuous mode
		/*1-write to config reg. bit 8 mode(0:continuous;1:single-shot,default);bits 9-11:gain amplifier.bit 15 set to 1 starts single shot
		*bits 14-12:multiplexor configuration
		*transmiter:address+0x01(points to config reg)+0b10000100(MSB:start shot+default gain+continuous)+0b10000011(LSB:default rate+no comparator)*/
		bytes_to_ADS1115_reg[0] = 0x01; //0x01(points to config reg)

		//for continuous mode. +-4.076V, 128 sps, bits 14-12 110: AINp=AIN0 and AInn=GND (single ended measurement for A0).
		//bytes_to_ADS1115_reg[1] = 0xC2; //0b11000010 (MSB)
		//bytes_to_ADS1115_reg[2] = 0x83; //0b10000011 (LSB)
		//for single-shot. bit 15: begin single conversion. bit 8: 1-single shot
		bytes_to_ADS1115_reg[1] = 0xC3; //0b11000011 (MSB)
		bytes_to_ADS1115_reg[2] = 0x83; //0b10000011 (LSB)

		//pI2Chandle->I2C_Comm_t.TX_buffer = bytes_to_ADS1115_reg; //buffer pointing to bytes_to_ADS1115_reg
		flagADS1115 = ADS1115_1ST_DURING;
		I2C_EnableDisable(&i2c1,ENABLE);
		I2C_Master_Transmitter(pI2Chandle, 3, 1, bytes_to_ADS1115_reg);
		//I2C_Start(pI2Chandle); //triggered directly in I2C_Master_Transmitter;in case of problems,do it from here and comment in I2C_Master_Transmitter
	}


	if (flagADS1115 == ADS1115_1ST_DONE){
		//2-select the conversion register by writing to pointer reg(0x00:conversion reg;0x01:config reg)
		//transmitter:address+0x00(points to conversion register)
		bytes_to_ADS1115_reg[0] = 0x00; //0x00(points to conversion register)
		//pI2Chandle->I2C_Comm_t.TX_buffer = bytes_to_ADS1115_reg; //buffer pointing to bytes_to_ADS1115_reg
		flagADS1115 = ADS1115_2ND_DURING;
		//I2C_EnableDisable(&i2c1,ENABLE);
		I2C_Master_Transmitter(pI2Chandle, 1, 1, bytes_to_ADS1115_reg);
		//I2C_Start(pI2Chandle); //triggered directly in I2C_Master_Transmitter;in case of problems,do it from here and comment in I2C_Master_Transmitter
	}

}

/************************************SPI COMMUNICATION STM32-ARDUINO************************************/
void spi_appComm(char** charPointer){
	//switch-case instead of while (TX/RXstate != READ) to avoid blocking
	switch (flagSPI){ //{SEND_PRINT,READ_PRINT,DUMMY_ACK,READ_ACK,SEND_LENGTH,READ_LENGTH,SEND_STATE,READ_STATE}
	case SEND_PRINT:
		//create the message (alternative:create it in case SEND_LENGTH,but maybe modify the startCounter placement)
	    station_char = trainStation+'0';
	    state_name = state_string_names[currentState];
	    //allocate in heap. +1 is for the null terminator at the end
	    *charPointer = malloc(strlen(station_string)+strlen(&station_char)+strlen(state_string)+strlen(state_name)+1);
	    //if (*charPointer==NULL) {//error;}
	    strncpy(*charPointer,station_string,strlen(station_string));
	    strncat(*charPointer,&station_char,strlen(&station_char));
	    strncat(*charPointer,state_string,strlen(state_string));
	    strncat(*charPointer,state_name,strlen(state_name));

		//enable SPI and disable it at the end
		SPI_EnableDisable(&spi1,ENABLE);
		//Reading data register to flush previous data (previously it had been working without this)
		//NOT IMPLEMENTED;IF NECESSARY,COPY FROM debugSemihosting: flushDR(&spi1, &myRXbuffer, 1);

		//Send print command.Ard should store it in its RX buffer and put ACK in TX.Master should receive garbage in shift reg.
		*myTXbuffer = SPI_COMMAND_PRINT;
		SPI_Send(&spi1, myTXbuffer, 1); //SPI_Send(&spi1, (uint8_t*)SPI_COMMAND_PRINT, 1);
		flagSPI = READ_PRINT;
		break;

	case READ_PRINT://Read master RX to clear the RX buffer for the next reading of ACK
		if (spi1.SPI_Comm.TX_state == SPI_READY){
			delay(500000);
			SPI_Read(&spi1, &myRXbuffer, 1); //1 byte to be read
			flagSPI = DUMMY_ACK;
		}
		break;

	case DUMMY_ACK://Send dummy data to Ard so that master receives ACK/NACK
		if (spi1.SPI_Comm.RX_state == SPI_READY){
			delay(500000);
			SPI_Send(&spi1, &dummy_byte, 1); //length 1 byte
			flagSPI = READ_ACK;
		}
		break;

