DaniMzT/MyProjects_STM32NucleoF091/Train/Src/train_LCD_timers.c
	case READ_ACK://Read master RX to get ACK/NACK
		if (spi1.SPI_Comm.TX_state == SPI_READY){
			delay(500000);
			SPI_Read(&spi1, &myRXbuffer, 1); //1 byte to be read
			flagSPI = SEND_LENGTH;
		}
		break;

	case SEND_LENGTH://if ACK, send length+currentState and receive response;otherwise,send it again
		if (spi1.SPI_Comm.RX_state == SPI_READY){
			delay(500000);
			if (myRXbuffer == SPI_ARD_ACK){
				*myTXbuffer = strlen(*charPointer); //in bytes. test: 0x01
				SPI_Send(&spi1, myTXbuffer, 1);
				flagSPI = READ_LENGTH;
			}
			else {
				//try to send it again
				flagSPI = SEND_PRINT;
			}
		}
		break;

	case READ_LENGTH://Read master RX
		if (spi1.SPI_Comm.TX_state == SPI_READY){
			delay(500000);
			SPI_Read(&spi1, &myRXbuffer, 1); //1 byte to be read
			flagSPI = SEND_STATE;
		}
		break;

	case SEND_STATE: //send the state+station
		if (spi1.SPI_Comm.RX_state == SPI_READY){
			delay(500000);
			*myTXbuffer = **charPointer; //in bytes. test: currentState
			SPI_Send(&spi1, myTXbuffer, 1);
			flagSPI = READ_STATE;
		}
		break;

	case READ_STATE: //read RXNE to clear it off to avoid overrun
		if (spi1.SPI_Comm.TX_state == SPI_READY){
			delay(500000);
			SPI_Read(&spi1, &myRXbuffer, 1); //1 byte to be read (dummy read).
			flagSPI = WAIT_END;
		}
		break;

	case WAIT_END:
		if (spi1.SPI_Comm.RX_state == SPI_READY){
			delay(500000);
			//clear the flag of current state in order to capture state changes
			stateChanged = 0;
			//Disable SPI
			SPI_EnableDisable(&spi1,DISABLE);
			//FREE IN HEAP
			free(*charPointer);
			//get ready for the next state change
			flagSPI = SEND_PRINT;
		}
		break;
	default:
		//error. print it in semihosting
		break;

	}
}
